#ifndef CTHERMOCONTROL_H
#define CTHERMOCONTROL_H

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

//допустимое количество пропущенных данных
#define MAX_LOST_DATA_VALUE 2

//класс управления термодатчиком
class CThermoControl
{
 protected:
  //-Переменные класса-------------------------------------------------------  
  float CurrentTemp;//текущая температура
  long EnabledCurrentTempCounter;//есть ли текущая температура  
  //-Функции класса----------------------------------------------------------
  //-Прочее------------------------------------------------------------------
 public:
  //-Конструктор класса------------------------------------------------------
  CThermoControl(void);
  //-Деструктор класса-------------------------------------------------------
  ~CThermoControl();
  //-Переменные класса-------------------------------------------------------
  //-Функции класса----------------------------------------------------------
  void SetData(unsigned char *data,unsigned char length);//установить данные
  bool GetCurrentTemp(float &temp);//получить текущую температуру  
  void NoData(void);//указать, что данные не пришли
  //-Прочее------------------------------------------------------------------
 protected:
};

#endif
